PH_data/alpha_0.85/0/TauDDES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/






FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      TauDDES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<symmTensor>
15853
(
( 7.863768587e-06 -6.264830972e-06 2.494260514e-07 7.461298082e-06 -2.464465183e-07 1.182571759e-05 )
( 8.210224223e-06 -6.148043212e-06 2.318372054e-07 7.90618833e-06 -2.369234267e-07 1.247715682e-05 )
( 7.533703865e-06 -6.216882412e-06 2.428734263e-07 7.178239684e-06 -2.495310127e-07 1.156308645e-05 )
( 8.53911115e-06 -5.80195956e-06 1.910977687e-07 8.510271073e-06 -2.080662966e-07 1.316193084e-05 )
( 7.801182619e-06 -6.195035439e-06 2.335041103e-07 7.468132935e-06 -2.462613224e-07 1.203758529e-05 )
( 7.154726063e-06 -6.063321962e-06 2.285135139e-07 6.840342849e-06 -2.394483545e-07 1.109284767e-05 )
( 7.169578112e-06 -6.080292223e-06 2.347636041e-07 6.823915101e-06 -2.406031854e-07 1.09901539e-05 )
( 8.713838724e-06 -5.474116733e-06 1.473810158e-07 8.974670891e-06 -1.76068113e-07 1.372931001e-05 )
...
)
;

boundaryField
{
    hill
    {
        type            calculated;
        value           uniform ( 0 0 0 0 0 0 );
    }
    top-wall
    {
        type            calculated;
        value           uniform ( 0 0 0 0 0 0 );
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 0 0 0 );
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 0 0 0 );
    }
}


// ************************************************************************* //
