PH_data/alpha_0.85/0/UDDES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/






FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      UDDES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
15853
(
( -0.002018663799 0.002212283434 7.077607734e-05 )
( -0.002227745019 0.002472617198 6.947502698e-05 )
( -0.001849421766 0.002015163423 6.66364067e-05 )
( -0.002475191839 0.002802737057 6.640561332e-05 )
( -0.001975189429 0.002169503365 6.472620589e-05 )
( -0.001661391812 0.001803426072 6.323472189e-05 )
( -0.001680791611 0.001822354272 6.605451199e-05 )
( -0.002631432377 0.003014264163 5.987312397e-05 )
...
)
;

boundaryField
{
    hill
    {
        type            calculated;
        value           uniform ( 0 0 0 );
    }
    top-wall
    {
        type            calculated;
        value           uniform ( 0 0 0 );
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 );
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
